<?php

    //ตัวแปร
    $mark = 85 ;
    $rdate = "1 สิงหาคม 2566";
    $congrate = "และให้มาสัมภาษณ์วันที่ 5 สิงหาคม 2566";
    $retest = "และให้มาสอบอีกครั้งวันที่ 5 สิงหาคม 2566";



        if( $mark < 50)
            echo "<h2>เสียใจด้วยคุณสอบไม่ผ่าน $retest</h2>" ,"<br>"; // ให้มาสอบอีกครั้งวันที่ 5 สิงหาคม 2566

        elseif ( $mark < 80)
            echo "<h4>ยินดีด้วยด้วยคุณสอบผ่าน</h4>"; // ให้มาสัมภาษณ์วันที่ 5 สิงหาคม 2566

        else{
            echo "<h1>ยินดีด้วยด้วยคุณสอบผ่าน ด้วยคะแนนยอดเยี่ยม</h1>","<br>"; 
            echo "กรุณามารายงานตัวในวันที่ $rdate $congrate","<br>";

        }
    //แสดงคะแนน
            echo  " "."<h3>คะแนนของคุณคือ $mark </h3>" ;



?>